In [1]:
import pandas as pd
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1. Selecting one column

## 1.1 Syntax 1

In [2]:
# select a column with [] (preffered way to select a column)
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [3]:
# checkout the data type of a column
type(df_exams['gender'])

pandas.core.series.Series

In [4]:
# series: attributes and methods (similar to the dataframes)
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [5]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [6]:
df_exams['gender'].tail()

995    female
996      male
997    female
998    female
999    female
Name: gender, dtype: object

## 1.2 Syntax 2

In [7]:
# select the column with . ( pitfall it will not work for a column name having space in it )
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [8]:
# accessing the column name having space using .
df_exams.math score

SyntaxError: invalid syntax (<ipython-input-8-c64d538dc9f8>, line 2)

In [ ]:
# accessing the same data with []
df_exams['math score']